{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": [
    128001,
    128008,
    128009
  ],
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 16384,
  "initializer_range": 0.02,
  "intermediate_size": 53248,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 128,
  "num_hidden_layers": 84,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "quantization_config": {
    "algo_config": {
      "compute_scale_loss": "MAE",
      "model_decoder_layers": "model.layers",
      "name": "autosmoothquant",
      "num_attention_heads": -1,
      "num_key_value_heads": -1,
      "scaling_layers": [
        {
          "inp": "self_attn.q_proj",
          "layers": [
            "self_attn.q_proj",
            "self_attn.k_proj",
            "self_attn.v_proj"
          ],
          "module2inspect": "self_attn",
          "prev_op": "input_layernorm"
        },
        {
          "inp": "self_attn.o_proj",
          "layers": [
            "self_attn.o_proj"
          ],
          "prev_op": "self_attn.v_proj"
        },
        {
          "inp": "mlp.gate_proj",
          "layers": [
            "mlp.gate_proj",
            "mlp.up_proj"
          ],
          "module2inspect": "mlp",
          "prev_op": "post_attention_layernorm"
        },
        {
          "inp": "mlp.down_proj",
          "layers": [
            "mlp.down_proj"
          ],
          "prev_op": "mlp.up_proj"
        }
      ]
    },
    "exclude": [
      "lm_head"
    ],
    "export": {
      "kv_cache_group": [
        "*k_proj",
        "*v_proj"
      ],
      "min_kv_scale": 1.0,
      "pack_method": "reorder",
      "weight_format": "real_quantized",
      "weight_merge_groups": null
    },
    "global_quant_config": {
      "bias": null,
      "input_tensors": {
        "ch_axis": -1,
        "dtype": "fp4",
        "group_size": 32,
        "is_dynamic": true,
        "is_mx_scale_constraint": false,
        "is_scale_quant": false,
        "mx_element_dtype": null,
        "observer_cls": "PerBlockMXObserver",
        "qscheme": "per_group",
        "round_method": "half_even",
        "scale_calculation_mode": "even",
        "scale_format": "e8m0",
        "scale_type": "float",
        "symmetric": null
      },
      "output_tensors": null,
      "target_device": null,
      "weight": {
        "ch_axis": -1,
        "dtype": "fp4",
        "group_size": 32,
        "is_dynamic": false,
        "is_mx_scale_constraint": false,
        "is_scale_quant": false,
        "mx_element_dtype": null,
        "observer_cls": "PerBlockMXObserver",
        "qscheme": "per_group",
        "round_method": "half_even",
        "scale_calculation_mode": "even",
        "scale_format": "e8m0",
        "scale_type": "float",
        "symmetric": null
      }
    },
    "layer_quant_config": {
      "*k_proj": {
        "bias": null,
        "input_tensors": {
          "ch_axis": -1,
          "dtype": "fp4",
          "group_size": 32,
          "is_dynamic": true,
          "is_mx_scale_constraint": false,
          "is_scale_quant": false,
          "mx_element_dtype": null,
          "observer_cls": "PerBlockMXObserver",
          "qscheme": "per_group",
          "round_method": "half_even",
          "scale_calculation_mode": "even",
          "scale_format": "e8m0",
          "scale_type": "float",
          "symmetric": null
        },
        "output_tensors": {
          "ch_axis": null,
          "dtype": "fp8_e4m3",
          "group_size": null,
          "is_dynamic": false,
          "is_mx_scale_constraint": null,
          "is_scale_quant": false,
          "mx_element_dtype": null,
          "observer_cls": "PerTensorMinMaxObserver",
          "qscheme": "per_tensor",
          "round_method": null,
          "scale_calculation_mode": null,
          "scale_format": null,
          "scale_type": null,
          "symmetric": null
        },
        "target_device": null,
        "weight": {
          "ch_axis": -1,
          "dtype": "fp4",
          "group_size": 32,
          "is_dynamic": false,
          "is_mx_scale_constraint": false,
          "is_scale_quant": false,
          "mx_element_dtype": null,
          "observer_cls": "PerBlockMXObserver",
          "qscheme": "per_group",
          "round_method": "half_even",
          "scale_calculation_mode": "even",
          "scale_format": "e8m0",
          "scale_type": "float",
          "symmetric": null
        }
      },
      "*v_proj": {
        "bias": null,
        "input_tensors": {
          "ch_axis": -1,
          "dtype": "fp4",
          "group_size": 32,
          "is_dynamic": true,
          "is_mx_scale_constraint": false,
          "is_scale_quant": false,
          "mx_element_dtype": null,
          "observer_cls": "PerBlockMXObserver",
          "qscheme": "per_group",
          "round_method": "half_even",
          "scale_calculation_mode": "even",
          "scale_format": "e8m0",
          "scale_type": "float",
          "symmetric": null
        },
        "output_tensors": {
          "ch_axis": null,
          "dtype": "fp8_e4m3",
          "group_size": null,
          "is_dynamic": false,
          "is_mx_scale_constraint": null,
          "is_scale_quant": false,
          "mx_element_dtype": null,
          "observer_cls": "PerTensorMinMaxObserver",
          "qscheme": "per_tensor",
          "round_method": null,
          "scale_calculation_mode": null,
          "scale_format": null,
          "scale_type": null,
          "symmetric": null
        },
        "target_device": null,
        "weight": {
          "ch_axis": -1,
          "dtype": "fp4",
          "group_size": 32,
          "is_dynamic": false,
          "is_mx_scale_constraint": false,
          "is_scale_quant": false,
          "mx_element_dtype": null,
          "observer_cls": "PerBlockMXObserver",
          "qscheme": "per_group",
          "round_method": "half_even",
          "scale_calculation_mode": "even",
          "scale_format": "e8m0",
          "scale_type": "float",
          "symmetric": null
        }
      }
    },
    "layer_type_quant_config": {},
    "quant_method": "quark",
    "quant_mode": "eager_mode",
    "softmax_quant_spec": null
  },
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "use_cache": true,
  "vocab_size": 128256
}
